Repository: tsafundzic/safa_hr
Catalog: lib/core/l10n/app_*.arb
Languages: hr

# languageEn
source: English
hr: Engleski

# languageHr
source: Croatian
hr: Hrvatski

# themeLight
source: Light
hr: Svjetla tema

# themeDark
source: Dark
hr: Tamna tema

# headerGallery
source: Gallery
hr: Galerija

# headerContact
source: Contact
hr: Kontakt

source: Hi there!
hr: Bok!

# welcomeToMyCornerOfInternet
source: Welcome to my corner of the internet!
hr: Dobrodošli u moj kutak interneta!

# aboutMe0
source: My name is Tomislav, and I'm a Master's degree holder in Computer Engineering. Beyond the world of code and algorithms, I am also a passionate photographer.
hr: Moje ime je Tomislav i magistar inženjer računarstva sam. Uz svijet koda i algoritama, također sam i fotograf.

# aboutMe1
source: My journey into the realm of technology began with a fascination for creating mobile applications. Over the years, I have dedicated myself to honing my skills and knowledge in software development, in 2020 I have focused on using Flutter to build high-quality, user-friendly applications. However, my journey is not confined to the software development domain alone. Photography has been my first love and a constant companion in my life. What started as a childhood hobby has evolved into a profound passion. I've invested not only in developing my technical expertise but also in acquiring the right equipment, reaching the level of master photographer.
hr: Moje putovanje u područje tehnologije počelo je izradom mobilnih aplikacija. Tijekom godina posvetio sam se usavršavanju svojih vještina i znanja u razvoju softvera, a 2020. sam se usredotočio na korištenje Fluttera za izradu visokokvalitetnih aplikacija prilagođenih korisnicima. Međutim, moje putovanje nije ograničeno samo na domenu razvoja softvera. Fotografija je bila moja prva ljubav i stalni pratilac u mom životu. Ono što je počelo kao hobi iz djetinjstva razvilo se u duboku strast. Uložio sam ne samo u razvoj svoje tehničke stručnosti, već i u nabavku odgovarajuće opreme, te 2020. godine postao majstor fotograf.

# aboutMe2
source: Beyond the screens and lenses, I find joy in exploring the world. Traveling allows me to immerse myself in diverse cultures, and it provides endless opportunities to capture the beauty of our planet through my lens. The combination of technology and artistry has shaped my unique perspective, whether I'm coding an application or framing a captivating photograph.
hr: Izvan ekrana i objektiva, radost pronalazim u istraživanju svijeta. Putovanje mi omogućuje da uronim u različite kulture i pruža beskrajne mogućnosti da uhvatim ljepote kroz objektiv. Kombinacija tehnologije i umjetnosti oblikovala je moju jedinstvenu perspektivu, bilo da kodiram aplikaciju ili kadriram zadivljujuću fotografiju.

# aboutMe3
source: Join me on this multifaceted journey where technology meets creativity, and each click of the camera or keystroke of code tells a story. I'm excited to share my experiences, knowledge, and the beauty I encounter along the way.
hr: Pridruži mi se na ovom višestranom putovanju gdje se tehnologija susreće s kreativnošću, a svaki klik kamere ili pritisak na tipku koda priča priču. Uzbuđen sam što mogu podijeliti svoja iskustva, znanje i ljepotu koju svakodnevno susrećem.

# letsGetInTouch
source: Get in Touch and Let's Capture the Fun!
hr: Imaš pitanja? Slobodno se javi.

# contactMe
source: Hey there, fellow memory-maker! Ready to turn your moments into timeless treasures? Fantastic! Drop me a line using the contacts below:
hr: Želiš svoje trenutke pretvoriti u bezvremensko blago? Javi se na neki od kontakata:

# email01
source: Feeling the email vibe? Feel free to drop me a line at
hr: Voliš email? Javi se sa svojim foto masterplanom na

# phone01
source: Feeling old-school and want to hear a human voice? Ring me up at
hr: Preferiraš dobri stari kontakt telefonom? Nazovi me na

# instagram01
source: Craving some Instagram fun? Sweet! Head over to
hr: Voliš i koristiš Instagram? Još fotki i kontakt pronađi na

# facebook01
source: For those who still rock the Facebook world, find me at
hr: Za one koji još uvijek udaraju po Facebooku, pronađite me na

# contactForm01
source: You are form addict? No problem, you can fill it here
hr: Obožavaš popunjavati obrasce? Popuni upitnik i pošalji upit

# contactDescription
source: Ready to capture your moments and create lasting memories? Have a question or a specific request? I'd love to hear from you! Fill out the form below, and I'll get back to you as soon as possible.
hr: Jeste li spremni zabilježiti svoje trenutke i stvoriti trajne uspomene? Imate pitanje ili konkretan zahtjev? Volio bih čuti od tebe! Ispunite obrazac u nastavku, a ja ću vam se javiti što je prije moguće.

source: Name
hr: Ime i prezime

# nameHint
source: Enter your full name
hr: Upišite ime i prezime

# emailHint
source: Ensure I have the right contact information to reach out to you
hr: Pobrinite se da email bude ispravan kako bih se mogao povratno javiti

source: Date
hr: Datum

# dateHint
source: If you have a particular date in mind
hr: Ako imate već definirani datum

source: Location
hr: Lokacija

# locationHint
source: If you have a particular location in mind
hr: Ako imate već definiranu lokaciju

source: Message
hr: Poruka

# messageHint
source: Share your thoughts, ideas, or any specific details about the photography services you're interested in. The more information, the better!
hr: Opišite svoje misli, ideje ili bilo koje specifične detalje o fotografskim uslugama koje vas zanimaju. Što više informacija, to bolje.

source: Send
hr: Pošalji
